import Footer from "@/components/modules/Footer/Footer";
import Navbar from "@/components/modules/navbar/Navbar";
import React from "react";
import connectToDB from "@/configs/db";
import styles from "@/styles/AboutUs.module.css"; // ایمپورت فایل CSS
import { authUser } from "@/utils/authUserLink";
import BreadCrumb from "@/components/modules/breadcrumb/BreadCrumb";

async function page() {
  connectToDB()

  const user = await authUser()



  return (
    <>
      <Navbar isLogin={user ? true : false} />
      <BreadCrumb  route={"درباره ما"} />
      <div className={styles.container}>
        {/* <section className={styles.section}>
          <h1>درباره ما</h1>
          <p>فنجان داغ خوارزمی قهوه ست</p>
        </section> */}

        <section>
          <p className={styles.content}>
            از سال ۱۳۹۵ تاکنون، فروشگاه قهوه آرامش با افتخار میزبان مشتریان و
            دوستداران قهوه بوده است. ما با بهره‌گیری از تجربه‌ای به قدمت چهار
            نسل و ارتباط مستمر با مصرف‌کنندگان، همواره کیفیت و اصالت را در
            اولویت کار خود قرار داده‌ایم
          </p>
          <p className={styles.content}>
            آرامش، به عنوان یکی از پیشگامان صنعت قهوه در ایران، از سال ۱۳۸۶
            (۲۰۰۷ میلادی) به عضویت انجمن تخصصی قهوه اروپا (SCAE) درآمده است. این
            مجموعه با واردات مستقیم بهترین مواد اولیه و انتخاب دقیق دانه‌های
            قهوه، همواره تلاش کرده تا محصولاتی با کیفیت جهانی به مشتریان خود
            ارائه دهد
          </p>
        </section>

        <main className={styles.main}>


          <div className={styles.card}>
            <h2>صاحب امتیاز : کافی شاپ آرامش</h2>
            <h3>داستان آرامش</h3>
            <p className={styles.content}>
              آرامش تنها یک نام نیست، بلکه نمادی از کیفیت، اصالت و عشق به قهوه
              است. ما در فروشگاه آرامش، با هدف ارائه بهترین تجربه قهوه به شما،
              همواره در تلاش هستیم تا با بهره‌گیری از دانش روز دنیا و
              تکنولوژی‌های پیشرفته، محصولاتی در سطح استانداردهای جهانی به شما
              عرضه کنیم
            </p>
            <p className={styles.content}>
              مجموعه آرامش اولین مجموعه مرتبط با قهوه در ایران است که در سال
              ۲۰۰۷ به عضویت انجمن تخصصی قهوه اروپا (Speciality Coffee
              Association of Europe) درآمده است. مدیریت این مجموعه بسیاری از
              دوره‌های مربوط به فرآوری قهوه را به صورت تخصصی در کارگاه‌های
              آموزشی این انجمن و همچنین کارگاه‌های تخصصی فرآوری قهوه، به خصوص در
              زمینه بو دادن قهوه (Roasting)، در کشور آمریکا که از پیشگامان این
              صنعت است، گذرانده است. اکنون با پشتوانه دستاوردهای گذشته و
              بهره‌گیری از تکنولوژی روز دنیا، آرامش وارد مرحله تولید قهوه به
              صورت صنعتی و گسترده شده است. ما مفتخریم اعلام کنیم که آرامش از این
              پس یک نام تجاری صنعتی در صنعت قهوه ایران است و همواره در تلاش
              هستیم تا با حفظ کیفیت و اصالت، محصولاتی در سطح استانداردهای جهانی
              به مشتریان خود ارائه دهیم.
            </p>
          </div>
          <div className={styles.card}>
            <p className={styles.content}>
              در بهمن ماه ۱۳۹۴، آرامش موفق به اخذ مجوزهای لازم از وزارت بهداشت،
              درمان و آموزش پزشکی و سازمان غذا و دارو شد و با تبدیل تولید سنتی
              به صنعتی، گامی بلند در جهت افزایش کیفیت و تنوع محصولات خود برداشت.
              همچنین، در فروردین ماه ۱۳۹۵، این مجموعه موفق به دریافت مدرک دیپلم
              دانش قهوه از انجمن تخصصی قهوه اروپا شد
            </p>
            <p className={styles.content}>
              از دیگر افتخارات مجموعه «قهوه ست» اخذ مدرک دیپلم دانش قهوه از
              انجمن قهوه تخصصی اروپا در فروردین ماه سال 95 است. (SCAE Coffee
              Diploma)
            </p>
            <p className={styles.content}>
              ما در فروشگاه قهوه آرامش، با افتخار محصولات خود را به شما عرضه
              می‌کنیم. این محصولات حاصل سال‌ها تجربه، دانش و تلاش بی‌وقفه در
              صنعت قهوه است. از قهوه‌های بو داده شده با تکنیک‌های پیشرفته گرفته
              تا انواع نوشیدنی‌های گرم و سرد، همه و همه در فضایی آرام و دل‌نشین
              در انتظار شما هستند.
            </p>
            <p className={styles.content}>
              به فروشگاه قهوه آرامش بیایید و طعم واقعی قهوه را در کنار ما تجربه <br/>
              کنید
            </p>
          </div>

        </main>
      </div>

      <Footer />
    </>
  );
}

export default page;
